Revit 2027 API
BuiltInFailures.RebarFailures.FormulaLengthExceedsArrayLengthLimit Property
 Fixed custom spacing formula produces an array length that exceeds the allowed limits.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FormulaLengthExceedsArrayLengthLimit { get; }
Public Shared ReadOnly Property FormulaLengthExceedsArrayLengthLimit As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FormulaLengthExceedsArrayLengthLimit {
	FailureDefinitionId^ get ();
}
static member FormulaLengthExceedsArrayLengthLimit : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace